# Import Modules

In [1]:
import pandas as pd
import numpy as np

print(pd.__version__)
print(np.__version__)

2.1.4
1.26.4

In [3]:
n_rows = 5
n_cols = 5
cols = tuple('ABCDE')

df = pd.DataFrame(np.random.randint(1, 10, size=(n_rows, n_cols)),
                  columns=cols)
df

   A  B  C  D  E
0  7  9  2  1  9
1  9  9  5  8  5
2  9  1  8  3  2
3  4  2  6  7  9
4  1  6  9  4  4

# Mengganti nama (label) untuk sebuah kolom pada Data Frame

In [4]:
df.rename(columns={'C' : 'Hobi'})

   A  B  Hobi  D  E
0  7  9     2  1  9
1  9  9     5  8  5
2  9  1     8  3  2
3  4  2     6  7  9
4  1  6     9  4  4

# Mengganti nama (label) untuk banyak kolom pada Data Frame

In [5]:
df.rename(columns={'A' : 'Nama', 'B' : 'Alamat', 'D' : 'Kota'})

   Nama  Alamat  C  Kota  E
0     7       9  2     1  9
1     9       9  5     8  5
2     9       1  8     3  2
3     4       2  6     7  9
4     1       6  9     4  4